# Version Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationVersionInfo..::..Version Property
FabricationVersionInfo Class See Also
---
The version number of the change.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public int Version { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Version As Integer
	Get
```

Visual C++
---
```text
public:
property int Version {
	int get ();
}
```

# See Also
FabricationVersionInfo Class
Autodesk.Revit.DB Namespace